#include<stdio.h>
#include<stdlib.h>
#include<stdint.h>
#include<string.h>

#include "include/aws_iot_config.h"
#include "include/aws_iot_log.h"
#include "include/aws_iot_version.h"
#include "include/aws_iot_mqtt_client_interface.h"
#include "include/aws_iot_shadow_interface.h"

/*=======================================================================================
* 函 数 名： write_plate_aws_iot_shadow_init
* 参    数： 
* 功能描述:  写盘器AWS IOT SHADOW 初始化
* 返 回 值： 
* 备    注： 
* 作    者： lc
* 创建时间： 2021-06-11 
==========================================================================================*/
IoT_Error_t write_plate_aws_iot_shadow_init(void) ;

/*=======================================================================================
* 函 数 名： write_plate_aws_iot_shadow_report_restaurantID
* 参    数： 
* 功能描述:  写盘器AWS IOT SHADOW restaurantID外部调用
* 返 回 值： 
* 备    注： 
* 作    者： lc
* 创建时间： 2021-06-11 
==========================================================================================*/
int write_plate_aws_iot_shadow_report_restaurantID(int64_t id) ;

/*=======================================================================================
* 函 数 名： write_plate_aws_iot_shadow_task
* 参    数： 
* 功能描述:  写盘器AWS IOT SHADOW 轮询任务
* 返 回 值： 
* 备    注： 
* 作    者： lc
* 创建时间： 2021-06-11 
==========================================================================================*/
int write_plate_aws_iot_shadow_task(void) ;

/*=======================================================================================
* 函 数 名： aws_iot_shadow_report_task
* 参    数： 
* 功能描述:  CappTask 线程里面调用时时上报信息到 aws iot
* 返 回 值： 
* 备    注： 
* 作    者： lc
* 创建时间： 2021-06-11 
==========================================================================================*/
void aws_iot_shadow_report_task(void);

/*=======================================================================================
* 函 数 名： get_aws_iot_dev_status
* 参    数： 
* 功能描述:  返回码当前的设备状态
* 返 回 值： 
* 备    注： 
* 作    者： lc
* 创建时间： 2021-06-11 
==========================================================================================*/
int  get_aws_iot_dev_status(void) ;

/*=======================================================================================
* 函 数 名： update_aws_iot_dev_status
* 参    数： 
* 功能描述:  更改设备状态
* 返 回 值： 
* 备    注： 
* 作    者： lc
* 创建时间： 2021-06-11 
==========================================================================================*/
void  update_aws_iot_dev_status(int status) ;

/*=======================================================================================
* 函 数 名： set_aws_iot_report_menuUpdateTime
* 参    数： 
* 功能描述:  设置iot 上报菜单已更新完成
* 返 回 值： 
* 备    注： 
* 作    者： lc
* 创建时间： 2021-06-11 
==========================================================================================*/
void  set_aws_iot_report_menuUpdateTime(void) ;

/*=======================================================================================
* 函 数 名： aws_send_data_to_qt
* 参    数： 
* 功能描述:  消息队列发送菜单获取状态
* 返 回 值： 
* 备    注： 
* 作    者： lc
* 创建时间： 2021-06-30 
==========================================================================================*/
void  aws_send_menu_status_to_qt(int status, int progress);

/*=======================================================================================
* 函 数 名： aws_send_ota_update_to_qt
* 参    数： status==更新状态；progress==更新进度
* 功能描述:  消息队列发送固件更新状态
* 返 回 值： 
* 备    注： 
* 作    者： lc
* 创建时间： 2021-06-30 
==========================================================================================*/
void aws_send_ota_update_to_qt(int status, int progress) ;
/*=======================================================================================
* 函 数 名： write_plate_aws_iot_poll_jobs_next
* 参    数： 
* 功能描述:  next/get。设备定期轮询以获取下一个任务（固件更新）。
* 返 回 值： 
* 备    注： 
* 作    者： lc
* 创建时间： 2021-06-11 
==========================================================================================*/
int write_plate_aws_iot_poll_jobs_next(void) ;

/*=======================================================================================
* 函 数 名： set_flag_report_iot_update_ok
* 参    数： 
* 功能描述:  外部调用设置标志位上报固件更新成功
* 返 回 值： 
* 备    注： 
* 作    者： lc
* 创建时间： 2021-07-12 
==========================================================================================*/
void set_flag_report_iot_update_ok(int status);

/*=======================================================================================
* 函 数 名： set_aws_iot_report_romVersion
* 参    数： 
* 功能描述:  设置iot 上报固件版本
* 返 回 值： 
* 备    注： 
* 作    者： lc
* 创建时间： 2021-06-11 
==========================================================================================*/
void  set_aws_iot_report_romVersion(void);

/*=======================================================================================
* 函 数 名： reboot_golang
* 参    数： 
* 功能描述:  golang 进程重启
* 返 回 值： 
* 备    注： 
* 作    者： lc
* 创建时间： 2021-07-22 
==========================================================================================*/
void reboot_golang(void);

int aws_iot_test(void);