#include<stdio.h>
#include<stdlib.h>
#include<string.h>
#include <sys/ioctl.h>
#include <sys/types.h>
#include <stdint.h>

/*=======================================================================================
* 函 数 名： beep_motor_init
* 参    数： 
* 功能描述:  蜂鸣器电机GPIO初始化
* 返 回 值： 
* 备    注： 
* 作    者： lc
* 创建时间： 2021-09-22 
==========================================================================================*/
void beep_motor_init(void);

/*=======================================================================================
* 函 数 名： beep_on
* 参    数： 
* 功能描述:  蜂鸣器启动
* 返 回 值： 
* 备    注： 
* 作    者： lc
* 创建时间： 2021-09-22 
==========================================================================================*/
void beep_on(uint8_t num);
