#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
#include <string.h>


//设备状态
enum {
  C_INIT_STATUS            = 0 ,//生产状态
	C_WAIT_TOPIC_STATUS ,      //证书获取完成等待订阅
	C_FACTORY_BIND_OK_STATUS , //完成出厂绑定（解绑状态）
	C_SITE_BIND_OK_STATUS ,    //现场绑定完成，可以正常写盘拉菜单
	C_LOCAL_UNBIND_STATUS ,    //本地解绑完成，一直上传解绑状态到后台
}cDevDtatus;

//写盘信息结构体
typedef struct 
{
  char uid[50];  //菜品名称
  int  price; //菜品价格
  uint16_t  dishid;//菜品ID
  int  res;//读取结果0代表成功
}dishMsgSt;

//设备信息结构体
typedef struct 
{
  char* devicetype;//写盘器设备类型
  char* subIP;//""
  char* hardVersion;//硬件版本
  char* version;//设备软件版本号
  char* versionBak;//设备软件版本号备份
  int   id;//设备id
  int   indent_code;//美餐识别码
  char* uuid;//uuid
  char* sn;//设备sn号印刷在设备背面
  int restaurantID;//餐厅id
  int   status;//设备当前状态 生产状态 =0，证书获取完成等待iot订阅 =1，出场状态（解绑完成）=2，现场绑定完成=3，本地解绑后台未解绑=4
}C_DevMsgSt;

//菜单信息结构体
typedef struct
{
  int64_t menu_ver; //菜单版本
  int64_t new_menu_ver; //新的菜单版本
  int menu_level;//菜单等级总数
}C_menuMsgSt;

//菜单数据结构体
typedef struct
{
  char* dbname; 
  char* premenu; 
  char* nextmenu; 
  int grade; 
  char* context; 
  char* spell; 
  int dish_id; 
  int price;
}C_MenuDataSt;

//shadow 配置信息结构体
typedef struct
{
  char* name;//shadow 名字
  char* clientid;//shadow clientid
}C_ShadowMsgSt;

/*==================================================================================
* 函 数 名： sqlite_create_process_protection_db
* 参    数： 
* 功能描述:  创建进程保护数据库
* 返 回 值： None
* 备    注： 创建成功返回0
* 作    者： lc
* 创建时间： 2021-09-27
==================================================================================*/
int sqlite_create_process_protection_db(void);

/*==================================================================================
* 函 数 名： sqlite_update_process_protection_db
* 参    数： 
* 功能描述:  修改进程数据库运行标志位
* 返 回 值： None
* 备    注： 修改成功返回0
* 作    者： lc
* 创建时间： 2021-09-27 //
==================================================================================*/
int sqlite_update_process_protection_db(void);

/*==================================================================================
* 函 数 名： sqlite_update_process_protection_db_null
* 参    数： 
* 功能描述:  清除进程数据库运行标志位
* 返 回 值： None
* 备    注： 修改成功返回0
* 作    者： lc
* 创建时间： 2021-09-27 //
==================================================================================*/
int sqlite_update_process_protection_db_null(void);

/*==================================================================================
* 函 数 名： sqlite_create_config_db
* 参    数： 
* 功能描述:  创建设备参数配置数据库
* 返 回 值： None
* 备    注： 创建成功返回0
* 作    者： lc
* 创建时间： 2021-05-25
==================================================================================*/
int sqlite_create_config_db();

/*==================================================================================
* 函 数 名： sqlite_create_food_menu_db
* 参    数： None
* 功能描述:  创建写盘菜单数据库
* 返 回 值： None
* 备    注： 创建成功返回0
* 作    者： lc
* 创建时间： 2021-04-22 
==================================================================================*/
int sqlite_create_food_menu_db(void);

/*================================================================================================================================
* 函 数 名： sqlite_read_device_satus
* 参    数： 
* 功能描述:  从配置数据库读取设备状态  0=生产状态，1=出场绑定状态，2=工作状态
* 返 回 值： 成功返回设备状态，失败返回 -1   
* 备    注： 
* 作    者： lc
* 创建时间： 2021-05-27 
===================================================================================================================================*/
int sqlite_read_device_satus(void);

/*================================================================================================================================
* 函 数 名： sqlite_read_meican_indent_code
* 参    数： 
* 功能描述:  从配置数据库读取美餐餐盘识别码
* 返 回 值： 成功返回识别码，失败返回 -1
* 备    注： 
* 作    者： lc
* 创建时间： 2021-05-27 
===================================================================================================================================*/
int sqlite_read_meican_indent_code(void);

/*================================================================================================================================
* 函 数 名： sqlite_read_menu_ver
* 参    数： 
* 功能描述:  从配置数据库读取当前菜单版本（时间戳）
* 返 回 值： 成功返回菜单版本，失败返回 -1
* 备    注： 
* 作    者： lc
* 创建时间： 2021-05-27 
===================================================================================================================================*/
int64_t sqlite_read_menu_ver(void);

/*==================================================================================
* 函 数 名： sqlite_create_menu_db
* 参    数： None
* 功能描述:  创建主菜单数据库
* 返 回 值： None
* 备    注： 初始化成功返回0
* 作    者： lc
* 创建时间： 2021-04-22 
==================================================================================*/
int sqlite_create_menu_db(char* dbname);

/*=================================================================================================================================
* 函 数 名： sqlite_insert_data_to_menu_db
* 参    数： 
* 功能描述:  插入数据到数据库dbname 上级菜单premenu，下级菜单nextmenu，当前等级grade，菜单名称context，菜单拼音spell，餐品ID dish_id，菜品价格price
* 返 回 值： 插入成功返回0
* 备    注： 
* 作    者： lc
* 创建时间： 2021-05-27 
===================================================================================================================================*/
int sqlite_insert_data_to_menu_db(C_MenuDataSt pmenust);

/*==================================================================================
* 函 数 名： sqlite_read_writePlateMsg_from_dishmenu
* 参    数： None
* 功能描述:  从写盘数据数据库读取写盘信息
* 返 回 值： None
* 备    注： 返回写盘信息结构体 
* 作    者： lc
* 创建时间： 2021-04-23 
==================================================================================*/
dishMsgSt sqlite_read_writePlateMsg_from_dishmenu();

/*================================================================================================================================
* 函 数 名： sqlite_insert_menu_db
* 参    数： 
* 功能描述:  插入数据到数据库 菜单名称context，餐品ID dish_id，菜品价格price
* 返 回 值： 插入成功返回0
* 备    注： 
* 作    者： lc
* 创建时间： 2021-04-22 
===================================================================================================================================*/
int sqlite_write_food_menu_db(char* context, int dish_id, int price);

/*==================================================================================
* 函 数 名： sqlite_read_devMsg_config_db
* 参    数： 
* 功能描述:  从配置数据库读取设备信息
* 返 回 值： None
* 备    注： 修改成功返回0
* 作    者： lc
* 创建时间： 2021-05-25 
==================================================================================*/
C_DevMsgSt sqlite_read_devMsg_from_config_db();

/*==================================================================================
* 函 数 名： sqlite_read_menuMsg_from_config_db
* 参    数： 
* 功能描述:  从配置数据库读取菜单信息
* 返 回 值： None
* 备    注： 修改成功返回0
* 作    者： lc
* 创建时间： 2021-05-25 
==================================================================================*/
C_menuMsgSt sqlite_read_menuMsg_from_config_db(void);

/*==================================================================================
* 函 数 名： sqlite_update_menuMsg_to_config_db
* 参    数： 
* 功能描述:  修改配置数据库菜单信息
* 返 回 值： None
* 备    注： 修改成功返回0
* 作    者： lc
* 创建时间： 2021-05-25 
==================================================================================*/
int sqlite_update_menuMsg_to_config_db(C_menuMsgSt menuSt);

/*==================================================================================
* 函 数 名： sqlite_change_devMsg_config_db
* 参    数： 菜单版本 menu_ver(Unix timestamp, 毫秒) 设备状态 dev_status 菜单等级 menu_level
             status = 0 修改菜单版本 status = 1 修改设备状态 status = 2 修改菜单等级
* 功能描述:  修改配置数据库参数
* 返 回 值： None
* 备    注： 修改成功返回0
* 作    者： lc
* 创建时间： 2021-05-25 //
==================================================================================*/
int sqlite_update_devMsg_to_config_db(C_DevMsgSt pdev);

/*================================================================================================================================
* 函 数 名： sqlite_read_shandow_config_message
* 参    数： 
* 功能描述:  从配置数据库读取shadow配置信息
* 返 回 值： 成功返回菜单版本，失败返回 -1
* 备    注： 
* 作    者： lc
* 创建时间： 2021-05-27 
===================================================================================================================================*/
C_ShadowMsgSt sqlite_read_shandow_config_message(void);

/*==================================================================================
* 函 数 名： sqlite_update_shadowMsg_to_config_db
* 参    数： 
* 功能描述:  修改配置数据库shadow信息
* 返 回 值： None
* 备    注： 修改成功返回0
* 作    者： lc
* 创建时间： 2021-05-25 //
==================================================================================*/
int sqlite_update_shadowMsg_to_config_db(C_ShadowMsgSt pdev);

/*==================================================================================
* 函 数 名： sqlite_update_dev_status_config_db
* 参    数： 
* 功能描述:  修改配置数据库设备状态
* 返 回 值： None
* 备    注： 修改成功返回0
* 作    者： lc
* 创建时间： 2021-05-25 //
==================================================================================*/
int sqlite_update_dev_status_config_db(int status);

/*==================================================================================
* 函 数 名： sqlite_update_dev_sn_config_db
* 参    数： 
* 功能描述:  修改配置数据库sn码
* 返 回 值： None
* 备    注： 修改成功返回0
* 作    者： lc
* 创建时间： 2021-05-25 //
==================================================================================*/
int sqlite_update_dev_sn_config_db(char *snbuf, char *code);

/*==================================================================================
* 函 数 名： sqlite_update_dev_restaurantId_config_db
* 参    数： 
* 功能描述:  修改配置数据库餐厅ID
* 返 回 值： None
* 备    注： 修改成功返回0
* 作    者： lc
* 创建时间： 2021-05-25 //
==================================================================================*/
int sqlite_update_dev_restaurantId_config_db(int64_t id);

/*==================================================================================
* 函 数 名： sqlite_update_version_config_db
* 参    数： 
* 功能描述:  修改配置数据库软件版本
* 返 回 值： None
* 备    注： 修改成功返回0
* 作    者： lc
* 创建时间： 2021-05-25 //
==================================================================================*/
int sqlite_update_version_config_db(char *str);

/*==================================================================================
* 函 数 名： sqlite_update_versionBak_config_db
* 参    数： 
* 功能描述:  修改配置数据库软件备份临时版本，固件更新完下次启动时读取跟软件版本字段比较
* 返 回 值： None
* 备    注： 修改成功返回0
* 作    者： lc
* 创建时间： 2021-05-25 //
==================================================================================*/
int sqlite_update_versionBak_config_db(char *jobid);

/*==================================================================================
* 函 数 名： sqlite_update_versionBak_config_db
* 参    数： 
* 功能描述:  修改配置数据库软件备份临时版本，固件更新完下次启动时读取跟软件版本字段比较
* 返 回 值： None
* 备    注： 修改成功返回0
* 作    者： lc
* 创建时间： 2021-05-25 //
==================================================================================*/
char* sqlite_read_versionBak_config_db(void);

/*==================================================================================
* 函 数 名： sqlite_read_uuid_config_db
* 参    数： 
* 功能描述:  配置数据库读取UUID
* 返 回 值： None
* 备    注： 修改成功返回0
* 作    者： lc
* 创建时间： 2021-05-25 //
==================================================================================*/
char* sqlite_read_uuid_config_db(void);

void malloc_devMsgSt(C_DevMsgSt pdev);
void free_devMsgSt(C_DevMsgSt pdev);


//数据库测试
void sqlite_test(void);
int sqlite_open_test();
